In [153]:
import pandas as pd
import numpy as np

In [154]:
data = pd.DataFrame({"food":["bacon","pulled pork","bacon","pastrami","corned beef", "bacon", "pastrami", "honey ham", "nova lox"], "ounces":[4,3,12,6,7.5,8,3,5,6]})

In [155]:
meat_to_animal = {"bacon":"pig", "pulled pork":"pig", "pastrami":"cow", "corned beef":"cow", "honey ham":"pig", "nova lox":"salmon"}

In [156]:
# Mappa il cibo all'animale
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

Conseideriamo ora il caso in cui abbiamo dei valaori estremi (consideriamo come se fossero NaN) che non rappresentano i nostri dari.

In [157]:
serie4 = pd.Series([1.,-1,0,5,-999.,2.,-999.,-1000.,3.])
serie4

0       1.0
1      -1.0
2       0.0
3       5.0
4    -999.0
5       2.0
6    -999.0
7   -1000.0
8       3.0
dtype: float64

In [158]:
serie4.replace([-999, -1000], np.nan)

0    1.0
1   -1.0
2    0.0
3    5.0
4    NaN
5    2.0
6    NaN
7    NaN
8    3.0
dtype: float64

In [159]:
serie4[serie4<2] = np.nan
serie4

0    NaN
1    NaN
2    NaN
3    5.0
4    NaN
5    2.0
6    NaN
7    NaN
8    3.0
dtype: float64

Vediamo come raggruppare i dati

In [160]:
df = pd.DataFrame({"key1":["a", "a", None, "b", "b", "a", None],
    "key2" : pd.Series([1, 2, 1, 2, 1, None, 1], dtype="Int64"),
    "data1" : np.random.standard_normal(7),
    "data2" : np.random.standard_normal(7)})
df

   key1  key2     data1     data2
0     a     1 -0.477417 -0.308308
1     a     2  0.534924  0.162896
2  None     1 -0.153741  0.762360
3     b     2  1.257622 -0.070465
4     b     1 -0.596857 -0.529073
5     a  <NA>  0.849211  0.081672
6  None     1 -0.510425  0.972736

In [161]:
# Vogliamo raggruppare i dati in base a e b

grupped = df['data1'].groupby(df["key1"])
grupped.mean()

key1
a    0.302239
b    0.330383
Name: data1, dtype: float64

In [162]:
grupped2 = df.groupby(df["key1"])
grupped2.mean()

      key2     data1     data2
key1
a      1.5  0.302239 -0.021247
b      1.5  0.330383 -0.299769

In [163]:
grupped3 = df['data1'].groupby([df["key1"], df["key2"]]).mean()
grupped3

key1  key2
a     1      -0.477417
      2       0.534924
b     1      -0.596857
      2       1.257622
Name: data1, dtype: float64

In [164]:
for gruppo, data_f in grupped:
    print(f'Gruppo: {gruppo}')
    print(data_f)

Gruppo: a
0   -0.477417
1    0.534924
5    0.849211
Name: data1, dtype: float64
Gruppo: b
3    1.257622
4   -0.596857
Name: data1, dtype: float64